{
  "caption": "Attribute Dictionary",
  "description": "The Attribute Dictionary defines schema attributes and includes references to the events and objects in which they are used.",
  "name": "dictionary",
  "attributes": {
    "accounts": {
      "caption": "User Accounts",
      "description": "The user accounts associated with the person.",
      "is_array": true,
      "type": "user"
    },
    "confidence_id": {
      "caption": "Confidence ID",
      "description": "The normalized confidence level refers to the accuracy of the rule that created the finding. A rule with a low confidence level means that the detection scope is wide and may create finding reports that may not be malicious in nature.",
      "enum": {
        "-1": {
          "caption": "Other",
          "description": "The confidence is not mapped to the defined enum values. See the <code>confidence</code> attribute, which contains a data source specific value."
        },
        "0": {
          "caption": "Unknown",
          "description": "No confidence is assigned."
        },
        "1": {
          "caption": "Low"
        },
        "2": {
          "caption": "Medium"
        },
        "3": {
          "caption": "High"
        }
      },
      "type": "integer_t"
    },
    "shell": {
      "caption": "Shell",
      "description": "The user's login shell.",
      "type": "string_t"
    },
    "kill_chain_phase": {
      "caption": "Kill Chain Phase",
      "description": "The <a target='_blank' href='https://www.lockheedmartin.com/en-us/capabilities/cyber/cyber-kill-chain.html'>Cyber Kill Chain®</a> phase.",
      "type": "string_t"
    },
    "home_dir": {
      "caption": "Home",
      "description": "The user's home folder.",
      "type": "path_t"
    },
    "full_name": {
      "caption": "Full Name",
      "description": "The full name of a user.",
      "type": "string_t"
    },
    "kill_chain_phase_id": {
      "caption": "Kill Chain Phase ID",
      "description": "The <a target='_blank' href='https://www.lockheedmartin.com/en-us/capabilities/cyber/cyber-kill-chain.html'>Cyber Kill Chain®</a> phase identifier.",
      "enum": {
        "-1": {
          "caption": "Other"
        },
        "0": {
          "caption": "Unknown",
          "description": "The kill chain phase is unknown."
        },
        "1": {
          "caption": "Reconnaissance",
          "description": "The attackers pick a target and perform a detailed analysis, start collecting information (email addresses, conferences information, etc.) and evaluate the victim’s vulnerabilities to determine how to exploit them."
        },
        "2": {
          "caption": "Weaponization",
          "description": "The attackers develop a malware weapon and aim to exploit the discovered vulnerabilities."
        },
        "3": {
          "caption": "Delivery",
          "description": "The intruders will use various tactics, such as phishing, infected USB drives, etc."
        },
        "4": {
          "caption": "Exploitation",
          "description": "The intruders start leveraging vulnerabilities to executed code on the victim’s system."
        },
        "5": {
          "caption": "Installation",
          "description": "The intruders install malware on the victim’s system."
        },
        "6": {
          "caption": "Command & Control",
          "description": "Malware opens a command channel to enable the intruders to remotely manipulate the victim's system."
        },
        "7": {
          "caption": "Actions on Objectives",
          "description": "With hands-on keyboard access, intruders accomplish the mission’s goal."
        }
      },
      "type": "integer_t"
    },
    "context": {
      "caption": "Context",
      "description": "The list of the context categories of the detection.",
      "is_array": true,
      "type": "string_t"
    },
    "nist": {
      "caption": "NIST List",
      "description": "The NIST Cybersecurity Framework recommendations for managing the cybersecurity risk.",
      "is_array": true,
      "type": "string_t"
    },
    "cis20": {
      "caption": "CIS 20 List",
      "description": "The CIS 20 is a list of 20 actions and practices an organization’s security team can take on such that cyber attacks or malware, are minimized and prevented.",
      "is_array": true,
      "type": "string_t"
    },
    "context_ids": {
      "caption": "Context IDs",
      "description": "The list of the context identifiers of the detection.",
      "enum": {
        "-1": {
          "caption": "Other",
          "description": "The category label identifier is not in the predefined list. See the <code>labels</code> attribute, which may contain additional category labels."
        },
        "0": {
          "caption": "Unknown",
          "description": "The context identifier is unknown"
        },
        "10": {
          "caption": "Source: Endpoint",
          "description": "Antivirus, Firewall, or some other protection software running on a device."
        },
        "11": {
          "caption": "Source: AD",
          "description": "Microsoft Active Directory."
        },
        "12": {
          "caption": "Source: Firewall",
          "description": "Network Based Firewall or system that provides information about network connections beyond hostnames or IP addresses. For example Netflow, DNS, and web proxy logs."
        },
        "13": {
          "caption": "Source: Application Log",
          "description": "Single application data log. For example Apache, JIRA, or Firefox logs. This label can be applied along with another source category label. The Application Log category does not include general operating system logs."
        },
        "14": {
          "caption": "Source: IPS",
          "description": "Network based IDS/IPS. This is also a generic category label for \"product of external security logic.\" If the detection was based on the IP addresses, bytes, or security zone from PAN logs, only Firewall would apply.  If PAN categorized the event as malware detection and you relied on that determination, then IPS label would also apply. The one exception to this is Endpoint."
        },
        "15": {
          "caption": "Source: Cloud Data",
          "description": "Cloud data logs. For example Amazon, Box, Office365, etc."
        },
        "16": {
          "caption": "Source: Correlation",
          "description": "Multiple data source types or the underlying source is unknown."
        },
        "17": {
          "caption": "Source: Printer",
          "description": "Printer logs."
        },
        "18": {
          "caption": "Source: Badge",
          "description": "Physical access control logs."
        },
        "20": {
          "caption": "Scope: Internal",
          "description": "The detection has a network component and the direction of the initiated connection or traffic is internal (both endpoints are considered internal, on-premises)."
        },
        "21": {
          "caption": "Scope: External",
          "description": "The detection has a network component and the direction of the initiated connection or traffic is external (both endpoints are considered external). For example cloud data with an external source."
        },
        "22": {
          "caption": "Scope: Inbound",
          "description": "The detection has a network component and the direction of the initiated connection or traffic is inbound (one of the endpoints is internal and the other one is external)."
        },
        "23": {
          "caption": "Scope: Outbound",
          "description": "The detection has a network component and the direction of the initiated connection or traffic is outbound (one of the endpoints is internal and the other one is external)."
        },
        "24": {
          "caption": "Scope: Local",
          "description": "The detection has no network component. For example a local privilege escalation or a badge based detection."
        },
        "25": {
          "caption": "Scope: Network",
          "description": "The detection has a network component, but the direction of the initiated connection or traffic is unknown."
        },
        "30": {
          "caption": "Outcome: Blocked",
          "description": "Unsuccessful or blocked security malware."
        },
        "31": {
          "caption": "Outcome: Allowed",
          "description": "Malware was not blocked. This is the default, if this category is not explicitly set, then it is assumed to be Allowed."
        },
        "40": {
          "caption": "Stage: Recon",
          "description": "The reconnaissance stage, such as scanning, DNS enumeration, or other observable attempts to gain information about the customer's network."
        },
        "41": {
          "caption": "Stage: Initial Access",
          "description": "The initial access tactic represents the vectors adversaries use to gain an initial foothold within a network."
        },
        "42": {
          "caption": "Stage: Execution",
          "description": "The execution tactic represents techniques that result in execution of adversary-controlled code on a local or remote system. This tactic is often used in conjunction with initial access as the means of executing code once access is obtained, and lateral movement to expand access to remote systems on a network."
        },
        "43": {
          "caption": "Stage: Persistence",
          "description": "Persistence is any access, action, or configuration change to a system that gives an adversary a persistent presence on that system. Adversaries will often need to maintain access to systems through interruptions such as system restarts, loss of credentials, or other failures that would require a remote access tool to restart or alternate backdoor for them to regain access."
        },
        "44": {
          "caption": "Stage: Privilege Escalation",
          "description": "Privilege escalation is the result of actions that allows an adversary to obtain a higher level of permissions on a system or network. Certain tools or actions require a higher level of privilege to work and are likely necessary at many points throughout an operation. Adversaries can enter a system with unprivileged access and must take advantage of a system weakness to obtain local administrator or SYSTEM/root level privileges. A user account with administrator-like access can also be used. User accounts with permissions to access specific systems or perform specific functions necessary for adversaries to achieve their objective may also be considered an escalation of privilege."
        },
        "45": {
          "caption": "Stage: Defense Evasion",
          "description": "Defense evasion consists of techniques an adversary may use to evade detection or avoid other defenses. Sometimes these actions are the same as or variations of techniques in other categories that have the added benefit of subverting a particular defense or mitigation. Defense evasion may be considered a set of attributes the adversary applies to all other phases of the operation."
        },
        "46": {
          "caption": "Stage: Credential Access",
          "description": "Credential access represents techniques resulting in access to or control over system, domain, or service credentials that are used within an enterprise environment. Adversaries will likely attempt to obtain legitimate credentials from users or administrator accounts (local system administrator or domain users with administrator access) to use within the network. This allows the adversary to assume the identity of the account, with all of that account's permissions on the system and network, and makes it harder for defenders to detect the adversary. With sufficient access within a network, an adversary can create accounts for later use within the environment."
        },
        "47": {
          "caption": "Stage: Discovery",
          "description": "Discovery consists of techniques that allow the adversary to gain knowledge about the system and internal network. When adversaries gain access to a new system, they must orient themselves to what they now have control of and what benefits operating from that system give to their current objective or overall goals during the intrusion. The operating system provides many native tools that aid in this post-compromise information-gathering phase."
        },
        "48": {
          "caption": "Stage: Lateral Movement",
          "description": "Lateral movement consists of techniques that enable an adversary to access and control remote systems on a network and could, but does not necessarily, include execution of tools on remote systems. The lateral movement techniques could allow an adversary to gather information from a system without needing additional tools, such as a remote access tool."
        },
        "49": {
          "caption": "Stage: Collection",
          "description": "Collection consists of techniques used to identify and gather information, such as sensitive files, from a target network prior to exfiltration. This category also covers locations on a system or network where the adversary may look for information to exfiltrate."
        },
        "50": {
          "caption": "Stage: Exfiltration",
          "description": "Exfiltration refers to techniques and attributes that result or aid in the adversary removing files and information from a target network. This category also covers locations on a system or network where the adversary may look for information to exfiltrate."
        },
        "51": {
          "caption": "Stage: Command And Control",
          "description": "The command and control tactic represents how adversaries communicate with systems under their control within a target network. There are many ways an adversary can establish command and control with various levels of covertness, depending on system configuration and network topology. Due to the wide degree of variation available to the adversary at the network level, only the most common factors were used to describe the differences in command and control. There are still a great many specific techniques within the documented methods, largely due to how easy it is to define new protocols and use existing, legitimate protocols and network services for communication."
        },
        "60": {
          "caption": "Consequence: Infection",
          "description": "Installation of malware on one of the included devices."
        },
        "61": {
          "caption": "Consequence: Reduced Visibility",
          "description": "Reduction in log output or other data used for detection. Implies a deliberate attempt to hide an attackers actions."
        },
        "62": {
          "caption": "Consequence: Data Destruction",
          "description": "Destruction of data- either thru deletion or encryption.  This is distinctly different from Reduced Visibility, because the goal is to destroy the data, not to hide activity."
        },
        "63": {
          "caption": "Consequence: Denial Of Service",
          "description": "Asset no longer performs it's normal functions."
        },
        "64": {
          "caption": "Consequence: Loss Of Control",
          "description": "Asset is no longer under a customer's control."
        },
        "70": {
          "caption": "Rares: Rare User",
          "description": "There was a rare user involved in this detection. This will typically be applied to a detection based on other entities (device, printer, service, etc.)."
        },
        "71": {
          "caption": "Rares: Rare Process",
          "description": "There was a rare process or application involved in this detection. This can apply to app detection like PAN or Blue Coat, process names, or PIDs. It can also be used with hashes or any other other method of uniquely identifying executable code."
        },
        "72": {
          "caption": "Rares: Rare Device",
          "description": "There was a rare physical device or virtual machine involved in this detection. This can be set if you are working with endpoint data, relying on identity resolution, or have a way to identify individual machines/instances. If you are relying on IP/Network or domains for determination, the more specific RareNetwork or RareDomain should be used."
        },
        "73": {
          "caption": "Rares: Rare Domain",
          "description": "There was a rare domain involved in this detection. This can be an Active Directory domain, a DNS domain, a Kerberos realm, or a tenant identifier. Use domain for logical groupings of devices."
        },
        "74": {
          "caption": "Rares: Rare Network",
          "description": "There was a rare network involved in this detection. This can be based on IP/Network blocks, firewall zones, Netflow interfaces, or other indicators based on routing packets."
        },
        "75": {
          "caption": "Rares: Rare Location",
          "description": "There was a rare location involved in this detection. This can be a GeoLocation based on IP/Endpoint or a physical location based on Badge data."
        },
        "80": {
          "caption": "Other: Peer Group",
          "description": "The detection also considered the behavior of the user's peers."
        },
        "81": {
          "caption": "Other: Brute Force",
          "description": "Attempt to gain access to a system by making a high volume of login attempts."
        },
        "82": {
          "caption": "Other: Policy Violation",
          "description": "Violation of a company policy."
        },
        "83": {
          "caption": "Other: Threat Intelligence",
          "description": "The detection is based on external intelligence source as having an indicator of compromise, threatening location, or security malware."
        },
        "84": {
          "caption": "Other: Flight Risk",
          "description": "This detection indicates that the user may plan on leaving the organization."
        },
        "85": {
          "caption": "Other: Removable Storage",
          "description": "The detection concerns USB drive or other physical storage capable of easy removal."
        }
      },
      "is_array": true,
      "type": "integer_t"
    },
    "detection": {
      "caption": "Detection",
      "description": "The detection reported by a detection or analytics engine.",
      "type": "detection"
    },
    "detection_end_time": {
      "caption": "Detection Start Time",
      "description": "The end time of a detection time period.",
      "type": "timestamp_t"
    },
    "detection_start_time": {
      "caption": "Detection Start Time",
      "description": "The start time of a detection time period.",
      "type": "timestamp_t"
    },
    "device_entities": {
      "caption": "Device Entities",
      "description": "The devices that are identified in reported the events.",
      "is_array": true,
      "type": "device_entity"
    },
    "emails": {
      "caption": "Emails",
      "description": "A list of emails of the person.",
      "is_array": true,
      "type": "email_t"
    },
    "first_name": {
      "caption": "First Name",
      "description": "The first name of a person.",
      "type": "string_t"
    },
    "host": {
      "caption": "Host",
      "description": "The originating hostname or IP address of the network device that generated the event.",
      "type": "string_t"
    },
    "impact": {
      "caption": "Impact",
      "description": "The impact of the detection, valid range 0-100.",
      "type": "integer_t"
    },
    "impact_id": {
      "caption": "Impact ID",
      "description": "The normalized impact of the detection.",
      "enum": {
        "-1": {
          "caption": "Other",
          "description": "The detection impact is not mapped. See the <code>impact</code> attribute, which contains a data source specific value."
        },
        "0": {
          "caption": "Unknown"
        },
        "1": {
          "caption": "Low"
        },
        "2": {
          "caption": "Medium"
        },
        "3": {
          "caption": "High"
        },
        "4": {
          "caption": "Critical"
        },
        "5": {
          "caption": "Fatal"
        }
      },
      "type": "integer_t"
    },
    "index": {
      "caption": "Index",
      "description": "The name of the index in which a given event is indexed.",
      "type": "string_t"
    },
    "is_public": {
      "caption": "Public Network",
      "description": "The indication of whether the network interface is a public IP address.",
      "type": "boolean_t"
    },
    "last_name": {
      "caption": "Last Name",
      "description": "The last name of a person.",
      "type": "string_t"
    },
    "linecount": {
      "caption": "Line Count",
      "description": "The number of lines an event contains. That is the number of lines an event contains before it is indexed.",
      "type": "integer_t"
    },
    "managed_by": {
      "caption": "Managed By",
      "description": "The distinguished name of the user that is assigned to manage this object.",
      "type": "string_t"
    },
    "names": {
      "caption": "Names",
      "description": "The names of the person.",
      "is_array": true,
      "type": "string_t"
    },
    "nickname": {
      "caption": "Nickname",
      "description": "The nickname of a person.",
      "type": "string_t"
    },
    "phones": {
      "caption": "Phones",
      "description": "The list of phone numbers.",
      "is_array": true,
      "type": "string_t"
    },
    "punct": {
      "caption": "Punctuation Pattern ",
      "description": "The punctuation pattern that is extracted from an event. The punctuation pattern is unique to types of events.",
      "type": "string_t"
    },
    "source": {
      "caption": "Event Source",
      "description": "The name of the file, stream, or other input from which the event originates. For data monitored from files and directories, the value of source is the full path, such as `/archive/server1/var/log/messages.0` or `/var/log/`. The value of source for network-based data sources is the protocol and port, such as UDP:514.",
      "type": "string_t"
    },
    "sourcetype": {
      "caption": "Source Type",
      "description": "The format of the data input from which the event originates, such as `access_combined` or `cisco_syslog`. The source type controls how the Splunk platform formats incoming data. [List of pretrained source types - Splunk Documentation](https://docs.splunk.com/Documentation/Splunk/8.2.3/Data/Listofpretrainedsourcetypes)",
      "type": "string_t"
    },
    "splunk_server": {
      "caption": "Splunk Server",
      "description": "The name of the Splunk server containing the event. Useful in a distributed Splunk environment.",
      "type": "string_t"
    },
    "suffix": {
      "caption": "Suffix",
      "description": "The suffix of a person. For example: <code>M.D.</code> or <code>Ph.D.</code>.",
      "type": "string_t"
    },
    "timestamp": {
      "caption": "Event Timestamp",
      "description": "The event's timestamp, which specifies the time at which the event occurred.",
      "type": "string_t"
    },
    "user_entities": {
      "caption": "User Entities",
      "description": "The users that are identified in reported the events.",
      "is_array": true,
      "type": "user_entity"
    }
  }
}
